<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// BBCodes
// Note to translators: you can translate everything but what's between { and }
$lang = array_merge($lang, array(
	'ACP_BBCODES_EXPLAIN'		=> 'ББКод је посебна примена HTML која нуди већу контролу над тим шта се и како приказује. Са ове странице можете додати, уклонити или учитати ББКодове.',
	'ADD_BBCODE'				=> 'Додај нови ББКод',

	'BBCODE_DANGER'				=> 'ББКод који покушавате да додате изгледа користи {TEXT} симбол унутар HTML атрибута. Ово је могући XSS безбедоносни пропуст. Пробајте коришћење више ограничавајућих {SIMPLETEXT} или {INTTEXT} типова уместо тога. Наставите само уколико разумете ризике и сматрате да је коришћење {TEXT} у потпуности немогуће избећи.',
	'BBCODE_DANGER_PROCEED'		=> 'Настави', //'I understand the risk',

	'BBCODE_ADDED'				=> 'ББКод је успешно додат.',
	'BBCODE_EDITED'				=> 'ББКод је успешно учитан.',
	'BBCODE_DELETED'			=> 'ББКод је успешно уклоњен.',
	'BBCODE_NOT_EXIST'			=> 'ББКод који сте изабрали не постоји.',
	'BBCODE_HELPLINE'			=> 'Помоћни ред',
	'BBCODE_HELPLINE_EXPLAIN'	=> 'Ово поље садржи текст ББКода при преласку миша.',
	'BBCODE_HELPLINE_TEXT'		=> 'Текст помоћног реда',
	'BBCODE_HELPLINE_TOO_LONG'	=> 'Помоћни ред који сте унели је предугачак.',

	'BBCODE_INVALID_TAG_NAME'	=> 'Назив ББКод тага који сте изабрали већ постоји.',
	'BBCODE_INVALID'			=> 'Ваш ББКод је конструисан у неисправном облику.',
	'BBCODE_OPEN_ENDED_TAG'		=> 'Ваш властити ББКод таг мора да садржи и отварајући и затварајући таг.',
	'BBCODE_TAG'				=> 'Таг',
	'BBCODE_TAG_TOO_LONG'		=> 'Име тага које сте унели је предугачко.',
	'BBCODE_TAG_DEF_TOO_LONG'	=> 'Одредница тага којег сте унели је предугачка, молимо вас да скратите одредницу тага.',
	'BBCODE_USAGE'				=> 'ББКод употреба',
	'BBCODE_USAGE_EXAMPLE'		=> '[highlight={COLOR}]{TEXT}[/highlight]<br /><br />[font={SIMPLETEXT1}]{SIMPLETEXT2}[/font]',
	'BBCODE_USAGE_EXPLAIN'		=> 'Овде одређујете како да користите ББКод. Замените било који променљиви унос одговарајућим симболом (%sпогледајте испод%s).',

	'EXAMPLE'						=> 'Пример:',
	'EXAMPLES'						=> 'Примери:',

	'HTML_REPLACEMENT'				=> 'HTML замена',
	'HTML_REPLACEMENT_EXAMPLE'		=> '&lt;span style="background-color: {COLOR};"&gt;{TEXT}&lt;/span&gt;<br /><br />&lt;span style="font-family: {SIMPLETEXT1};"&gt;{SIMPLETEXT2}&lt;/span&gt;',
	'HTML_REPLACEMENT_EXPLAIN'		=> 'Овде одређујете подразумевану HTML замену. Не заборавите да вратите симболе које сте користили изнад!',

	'TOKEN'					=> 'Симбол',
	'TOKENS'				=> 'Симболи',
	'TOKENS_EXPLAIN'		=> 'Симболи су држачи за корисников унос. Унос ће бити потврђен само уколико се поклапа са одговарајућом одредницом. Уколико је потребно, можете их нумерисати додавањем броја као последњег знака између заграда, н.пр. {TEXT1}, {TEXT2}.<br /><br />Унутар HTML замене можете такође користити било који језички стринг присутан у вашој language/ фасцикли као ово: {L_<em>&lt;STRINGNAME&gt;</em>} где је <em>&lt;STRINGNAME&gt;</em> име преведеног стринга који желите да додате. На пример, {L_WROTE} ће бити приказано као “wrote” или као његов превод у зависности од корисниковог језика.<br /><br /><strong>Молимо знајте да само симболи на списку испод могу бити коришћени у властитим ББКодовима.</strong>',
	'TOKEN_DEFINITION'		=> 'Шта може да буде?',
	'TOO_MANY_BBCODES'		=> 'Не можете више правити ББКодове. Молимо вас да уклоните један или више ББКодова и пробате поново.',

	'tokens'	=>	array(
		'TEXT'			=> 'Било какав текст, укључујући стране знакове, бројеве, итд… Не би требало да користите овај симбол у HTML таговима. Уместо тога пробајте да користите IDENTIFIER, INTTEXT или SIMPLETEXT.',
		'SIMPLETEXT'	=> 'Латинични знакови (A-Z), бројеви, размаци, зарези, тачке, минус, плус, хифен и цртица за подвлачење текста',
		'INTTEXT'		=> 'Уникод слова, бројеви, размаци, зарези, тачке, минус, плус, хифен, цртица за подвлачење текста и whitespaces.',
		'IDENTIFIER'	=> 'Латинични знакови (A-Z), бројеви, хифен и цртица за подвлачење текста',
		'NUMBER'		=> 'Било каква серија бројева',
		'EMAIL'			=> 'Исправна мејл адреса',
		'URL'			=> 'Исправан URL користећи било који протокол (http, ftp, итд… не може бити коришћен за javascript). Ако ништа није дато, “http://” је префикс стринга.',
		'LOCAL_URL'		=> 'Месни URL. URL мора бити у односу са страницом теме и не може садржати име сервера или протокол, јер су линкови са префиксом “%s”',
		'RELATIVE_URL'	=> 'Односни URL. Ово можете да користите за поклапање URL делова, али будите пажљиви: пун URL је ваљан односни URL. Када желите да користите односне URLs вашег форума, користите LOCAL_URL симбол.',
		'COLOR'			=> 'HTML боја, може бити било у нумеричком облику <samp>#FF1234</samp> или <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-color">CSS лозинка боје</a> као <samp>fuchsia</samp> или <samp>InactiveBorder</samp>',
	),
));

// Smilies and topic icons
$lang = array_merge($lang, array(
	'ACP_ICONS_EXPLAIN'		=> 'Са ове странице можете додавати, уклањати или учитавати иконице које корисници могу додавати својим темама или порукама. Ове иконице се уопште приказују поред назива тема на списку форума, или назива порука на списку тема. Можете такође инсталирати и направити нове пакете иконица.',
	'ACP_SMILIES_EXPLAIN'	=> 'Смајлићи или емотикони су обично мале, понекада анимиране сличице које се користе да опишу емоцију или осећање. Са ове странице можете додавати, уклањати и учитавати смајлиће које корисници могу да користе у њиховим порукама и приватним порукама. Можете такође инсталирати и направити нове пакете смајлића.',
	'ADD_SMILIES'			=> 'Додај вишеструке смајлиће',
	'ADD_SMILEY_CODE'		=> 'Додај додатни код смајлића',
	'ADD_ICONS'				=> 'Додај вишеструке иконице',
	'AFTER_ICONS'			=> 'После %s',
	'AFTER_SMILIES'			=> 'После %s',

	'CODE'						=> 'Код',
	'CURRENT_ICONS'				=> 'Тренутне иконице',
	'CURRENT_ICONS_EXPLAIN'		=> 'Изаберите шта урадити са тренутно инсталираним иконицама.',
	'CURRENT_SMILIES'			=> 'Тренутни смајлићи',
	'CURRENT_SMILIES_EXPLAIN'	=> 'Изаберите шта урадити са тренутно инсталираним смајлићима.',

	'DISPLAY_ON_POSTING'		=> 'Прикажи на страници писања поруке',
	'DISPLAY_POSTING'			=> 'На страници писања поруке',
	'DISPLAY_POSTING_NO'		=> 'Не на страници писања поруке',

	'EDIT_ICONS'				=> 'Учитај иконице',
	'EDIT_SMILIES'				=> 'Учитај смајлиће',
	'EMOTION'					=> 'Осећање',
	'EXPORT_ICONS'				=> 'Извези и преузми icons.pak',
	'EXPORT_ICONS_EXPLAIN'		=> '%sКликом на ову везу, конфигурација за ваше инсталиране иконице ће бити спакована у <samp>icons.pak</samp> који када се једном преузме може бити коришћен за прављење <samp>.zip</samp> или <samp>.tgz</samp> датотеке која садржи све ваше иконице плус ову <samp>icons.pak</samp> конфигурациону датотеку%s.',
	'EXPORT_SMILIES'			=> 'Извези и преузми smilies.pak',
	'EXPORT_SMILIES_EXPLAIN'	=> '%sКликом на ову везу, конфигурација за ваше инсталиране смајлиће ће бити спакована у <samp>smilies.pak</samp> који када се једном преузме може бити коришћен за прављење <samp>.zip</samp> или <samp>.tgz</samp> датотеке која садржи све ваше иконице плус ову <samp>smilies.pak</samp> конфигурациону датотеку%s.',

	'FIRST'			=> 'Први',

	'ICONS_ADD'				=> 'Додај нову иконицу',
	'ICONS_ADDED'			=> array(
		0	=> 'Ниједна иконица није додата.',
		1	=> 'Иконица је успешно додата.',
		2	=> 'Иконице су успешно додате.',
	),
	'ICONS_CONFIG'			=> 'Конфигурација иконица',
	'ICONS_DELETED'			=> 'Иконица је успешно уклоњена.',
	'ICONS_EDIT'			=> 'Учитај иконицу',
	'ICONS_EDITED'			=> array(
		0	=> 'Ниједна иконица није ажурирана.',
		1	=> 'Иконица је успешно ажурирана.',
		2	=> 'Иконице су успешно ажуриране.',
	),
	'ICONS_HEIGHT'			=> 'Висина иконице',
	'ICONS_IMAGE'			=> 'Слика иконице',
	'ICONS_IMPORTED'		=> 'Пакет иконица је успешно инсталиран.',
	'ICONS_IMPORT_SUCCESS'	=> 'Пакет иконица је успешно увезен.',
	'ICONS_LOCATION'		=> 'Место иконица',
	'ICONS_NOT_DISPLAYED'	=> 'Следеће иконице нису приказане на страници за писање поруке',
	'ICONS_ORDER'			=> 'Редослед иконица',
	'ICONS_URL'				=> 'Датотека иконице',
	'ICONS_WIDTH'			=> 'Ширина иконице',
	'IMPORT_ICONS'			=> 'Инсталирај пакет иконица',
	'IMPORT_SMILIES'		=> 'Инсталирај пакет смајлића',

	'KEEP_ALL'			=> 'Задржи све',

	'MASS_ADD_SMILIES'	=> 'Додај вишеструке смајлиће',

	'NO_ICONS_ADD'		=> 'Нема иконица доступних за додавање.',
	'NO_ICONS_EDIT'		=> 'Нема иконица доступних за измену.',
	'NO_ICONS_EXPORT'	=> 'Немате иконице са којима бисте направили пакет.',
	'NO_ICONS_PAK'		=> 'Није пронађен пакет са иконицама.',
	'NO_SMILIES_ADD'	=> 'Нема смајлића доступних за додавање.',
	'NO_SMILIES_EDIT'	=> 'Нема смајлића доступних за измену.',
	'NO_SMILIES_EXPORT'	=> 'Немате смајлиће са којима бисте направили пакет.',
	'NO_SMILIES_PAK'	=> 'Није пронађен пакет са смајлићима.',

	'PAK_FILE_NOT_READABLE'		=> 'Не могу да прочитам <samp>.pak</samp> датотеку.',

	'REPLACE_MATCHES'	=> 'Замени поклапања',

	'SELECT_PACKAGE'			=> 'Изаберите датотеку пакета',
	'SMILIES_ADD'				=> 'Додај нови смајлић',
	'SMILIES_ADDED'				=> array(
		0	=> 'Ниједан смајлић није додат.',
		1	=> 'Смајлић је успешно додат.',
		2	=> 'Смајлићи су успешно додати.',
	),
	'SMILIES_CODE'				=> 'Код смајлића',
	'SMILIES_CONFIG'			=> 'Конфигурација смајлића',
	'SMILIES_DELETED'			=> 'Смајлић је успешно уклоњен.',
	'SMILIES_EDIT'				=> 'Учитај смајлић',
	'SMILIE_NO_CODE'			=> 'Смајлић “%s” је игнорисан, пошто нема унесен код.',
	'SMILIE_NO_EMOTION'			=> 'Смајлић “%s” је игнорисан, пошто нема унесену емоцију.',
	'SMILIE_NO_FILE'			=> 'Смајлић “%s” је игнорисан, пошто датотека недостаје.',
	'SMILIES_EDITED'			=> array(
		0	=> 'Ниједан смајлић није ажуриран.',
		1	=> 'Смајлић је успешно ажуриран.',
		2	=> 'Смајлићи су успешно ажурирани.',
	),
	'SMILIES_EMOTION'			=> 'Осећање',
	'SMILIES_HEIGHT'			=> 'Висина смајлића',
	'SMILIES_IMAGE'				=> 'Слика смајлића',
	'SMILIES_IMPORTED'			=> 'Пакет смајлића је успешно инсталиран.',
	'SMILIES_IMPORT_SUCCESS'	=> 'Пакет смајлића је успешно увезен.',
	'SMILIES_LOCATION'			=> 'Место смајлића',
	'SMILIES_NOT_DISPLAYED'		=> 'Следећи смајлићи неће бити приказани на страници за писање порука',
	'SMILIES_ORDER'				=> 'Редослед смајлића',
	'SMILIES_URL'				=> 'Датотека слике смајлића',
	'SMILIES_WIDTH'				=> 'Ширина смајлића',

	'TOO_MANY_SMILIES'			=> array(
		1	=> 'Ограничење од %d смајлића је достигнуто.',
		2	=> 'Ограничење од %d смајлића је достигнуто.',
	),

	'WRONG_PAK_TYPE'	=> 'Одабрани пакет не садржи одговарајуће податке.',
));

// Word censors
$lang = array_merge($lang, array(
	'ACP_WORDS_EXPLAIN'		=> 'Са ове контролне плоче можете додавати, учитавати, и уклањати речи које ће бити аутоматски пречишћене на вашим форумима. Људима је и даље дозвољено да се региструју са корисничким именима која садрже ове речи. Џокери (*) се прихватају у пољу речи, н.пр. *тест* ће се поклапати са атести, тест* би се поклапао са тестирање, *тест би се поклапао са атест.',
	'ADD_WORD'				=> 'Додај нову реч',

	'EDIT_WORD'		=> 'Учитај пречистач речи',
	'ENTER_WORD'	=> 'Морате унети реч и њену замену.',

	'NO_WORD'	=> 'Ниједна реч није изабрана за учитавање.',

	'REPLACEMENT'	=> 'Замена',

	'UPDATE_WORD'	=> 'Ажурирај пречистач речи',

	'WORD'				=> 'Реч',
	'WORD_ADDED'		=> 'Пречистач речи је успешно додат.',
	'WORD_REMOVED'		=> 'Одабрани пречистач речи је успешно уклоњен.',
	'WORD_UPDATED'		=> 'Одабрани пречистач речи је успешно ажуриран.',
));

// Ranks
$lang = array_merge($lang, array(
	'ACP_RANKS_EXPLAIN'		=> 'Користећи овај образац можете додавати, учитавати, прегледати и брисати чинове. Можете такође направити посебне чинове који могу бити примењени на корисника преко управљања корисницима.',
	'ADD_RANK'				=> 'Додај нови чин',

	'MUST_SELECT_RANK'		=> 'Морате изабрати чин.',

	'NO_ASSIGNED_RANK'		=> 'Није додељен посебан чин.',
	'NO_RANK_TITLE'			=> 'Нисте изабрали назив за чин.',
	'NO_UPDATE_RANKS'		=> 'Чин је успешно обрисан. Међутим кориснички налози који користе овај чин нису ажурирани. Треба да ручно вратите чин за те налоге.',

	'RANK_ADDED'			=> 'Чин је успешно додат.',
	'RANK_IMAGE'			=> 'Слика чина',
	'RANK_IMAGE_EXPLAIN'	=> 'Користите ово како бисте одредили малу слику за овај чин. Путања је у односу на root phpBB фасциклу.',
	'RANK_IMAGE_IN_USE'		=> '(Користи се)',
	'RANK_MINIMUM'			=> 'Најмање порука',
	'RANK_REMOVED'			=> 'Чин је успешно обрисан.',
	'RANK_SPECIAL'			=> 'Постави као посебан чин',
	'RANK_TITLE'			=> 'Назив чина',
	'RANK_UPDATED'			=> 'Чин је успешно ажуриран.',
));

// Disallow Usernames
$lang = array_merge($lang, array(
	'ACP_DISALLOW_EXPLAIN'	=> 'Овде можете да контролишете корисничка имена која неће бити дозвољена за коришћење. Недозвољена корисничка имена могу да садрже знак џокера *.',
	'ADD_DISALLOW_EXPLAIN'	=> 'Можете недозволити корисничко име користећи знак џокера * за поклапање са било којим знаком.',
	'ADD_DISALLOW_TITLE'	=> 'Додај недозвољено корисничко име',

	'DELETE_DISALLOW_EXPLAIN'	=> 'Можете да уклоните недозвољено корисничко име избором корисничког имена са овог списка и онда кликом на прихвати.',
	'DELETE_DISALLOW_TITLE'		=> 'Уклони недозвољено корисничко име',
	'DISALLOWED_ALREADY'		=> 'Име које сте унели је већ недозвољено.',
	'DISALLOWED_DELETED'		=> 'Недозвољено корисничко име је успешно уклоњено.',
	'DISALLOW_SUCCESSFUL'		=> 'Недозвољено корисничко име је успешно додато.',

	'NO_DISALLOWED'				=> 'Нема недозвољених корисничких имена',
	'NO_USERNAME_SPECIFIED'		=> 'Нисте изабрали или унели корисничко име са којим се ради.',
));

// Reasons
$lang = array_merge($lang, array(
	'ACP_REASONS_EXPLAIN'	=> 'Овде можете да управљате разлозима коришћеним у пријавама и порукама за одбијање када се недозвољавају поруке. Постоји један подразумевани разлог (означен са *) који не можете да уклоните, овај разлог је уобичајено коришћен за властите поруке уколико не одговара ниједан разлог.',
	'ADD_NEW_REASON'		=> 'Додај нови разлог',
	'AVAILABLE_TITLES'		=> 'Доступни називи преведених разлога',

	'IS_NOT_TRANSLATED'			=> 'Разлог <strong>није</strong> преведен.',
	'IS_NOT_TRANSLATED_EXPLAIN'	=> 'Разлог <strong>није</strong> преведен. Уколико желите да пружите преведен образац, назначите исправан кључ из језичких датотека у одељку разлога пријаве.',
	'IS_TRANSLATED'				=> 'Разлог је преведен.',
	'IS_TRANSLATED_EXPLAIN'		=> 'Разлог је преведен. Уколико је назив који сте унели овде назначен у језичким датотекама у одељку разлога пријаве, преведени образац назива и описа ће бити коришћен.',

	'NO_REASON'					=> 'Разлог није пронађен.',
	'NO_REASON_INFO'			=> 'Морате да унесете назив и опис за овај разлог.',
	'NO_REMOVE_DEFAULT_REASON'	=> 'Не можете да уклоните подразумевани разлог “Остало”.',

	'REASON_ADD'				=> 'Додај разлог за пријаву/одбијање',
	'REASON_ADDED'				=> 'Разлог за пријаву/одбијање је успешно додат.',
	'REASON_ALREADY_EXIST'		=> 'Разлог са овим називом већ постоји, молимо вас да унесете другачији назив за овај разлог.',
	'REASON_DESCRIPTION'		=> 'Опис разлога',
	'REASON_DESC_TRANSLATED'	=> 'Опис приказаног разлога',
	'REASON_EDIT'				=> 'Учитај разлог за пријаву/одбијање',
	'REASON_EDIT_EXPLAIN'		=> 'Овде можете да додате или учитате разлог. Уколико је разлог преведен онда се користи преведена верзија уместо описа унетог овде.',
	'REASON_REMOVED'			=> 'Разлог за пријаву/одбијање је успешно уклоњен.',
	'REASON_TITLE'				=> 'Назив разлога',
	'REASON_TITLE_TRANSLATED'	=> 'Приказани назив разлога',
	'REASON_UPDATED'			=> 'Разлог за пријаву/одбијање је успешно ажуриран.',

	'USED_IN_REPORTS'		=> 'Користи се у пријавама',
));
