<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Custom profile fields
$lang = array_merge($lang, array(
	'ADDED_PROFILE_FIELD'	=> 'Властито поље профила је успешно додато.',
	'ALPHA_DOTS'			=> 'Алфанумерички и тачке (повремено)',
	'ALPHA_ONLY'			=> 'Само алфанумерички',
	'ALPHA_SPACERS'			=> 'Алфанумерички и размаци',
	'ALPHA_UNDERSCORE'		=> 'Алфанумерички и цртице за подвлачење текста',
	'ALPHA_PUNCTUATION'		=> 'Алфанумерички са зарезима, тачкама, цртицама за подвлачење текста и цртицама које почињу са словом',
	'ALWAYS_TODAY'			=> 'Увек тренутни датум',

	'BOOL_ENTRIES_EXPLAIN'	=> 'Унесите сада ваше понуде',
	'BOOL_TYPE_EXPLAIN'		=> 'Одредите тип, било кућице било дугмета. Кућица ће бити приказана само уколико је означена за датог корисника. У том случају <strong>друге</strong> језичке поставке ће бити коришћене. Дугмад ће бити приказана без обзира на њихове вредности.',

	'CHANGED_PROFILE_FIELD'		=> 'Поље профила је успешно промењено.',
	'CHARS_ANY'					=> 'Било који знак',
	'CHECKBOX'					=> 'Кућица',
	'COLUMNS'					=> 'Колоне',
	'CP_LANG_DEFAULT_VALUE'		=> 'Подразумевана вредност',
	'CP_LANG_EXPLAIN'			=> 'Опис поља',
	'CP_LANG_EXPLAIN_EXPLAIN'	=> 'Објашњење за ово поље које се представља кориснику.',
	'CP_LANG_NAME'				=> 'Назив поља/поља које се представља кориснику',
	'CP_LANG_OPTIONS'			=> 'Поставке',
	'CREATE_NEW_FIELD'			=> 'Направи ново поље',
	'CUSTOM_FIELDS_NOT_TRANSLATED'	=> 'Најмање једно властито поље још није преведено. Молимо вас да унесете потребне податке кликом на везу “Преведи”.',

	'DEFAULT_ISO_LANGUAGE'			=> 'Подразумевани језик [%s]',
	'DEFAULT_LANGUAGE_NOT_FILLED'	=> 'Језички уноси за подразумевани језик нису попуњени за ово поље профила.',
	'DEFAULT_VALUE'					=> 'Подразумевана вредност',
	'DELETE_PROFILE_FIELD'			=> 'Уклони поље профила',
	'DELETE_PROFILE_FIELD_CONFIRM'	=> 'Да ли сигурно желите да обришете ово поље профила?',
	'DISPLAY_AT_PROFILE'			=> 'Прикажи у корисничкој контролној плочи',
	'DISPLAY_AT_PROFILE_EXPLAIN'	=> 'Корисник може да промени ово поље профила у корисничкој контролној плочи.',
	'DISPLAY_AT_REGISTER'			=> 'Прикажи на екрану за регистрацију',
	'DISPLAY_AT_REGISTER_EXPLAIN'	=> 'Уколико је ова поставка омогућена, поље ће бити приказано при регистрацији.',
	'DISPLAY_ON_MEMBERLIST'			=> 'Прикажи на екрану списка чланова',
	'DISPLAY_ON_MEMBERLIST_EXPLAIN'	=> 'Уколико је ова поставка омогућена, поље ће бити приказано у редовима корисника на екрану списка чланова.',
	'DISPLAY_ON_PM'					=> 'Прикажи на екрану прегледа приватних порука',
	'DISPLAY_ON_PM_EXPLAIN'			=> 'Уколико је ова поставка омогућена, поље ће бити приказано у мини-профилу на екрану прегледа приватних порука.',
	'DISPLAY_ON_VT'					=> 'Приказ на страници прегледа тема',
	'DISPLAY_ON_VT_EXPLAIN'			=> 'Уколико је ова поставка омогућена, поље ће бити приказано у мини-профилу на страници теме.',
	'DISPLAY_PROFILE_FIELD'			=> 'Јавно прикажи поље профила',
	'DISPLAY_PROFILE_FIELD_EXPLAIN'	=> 'Поље профила ће бити приказано на свим местима дозвољеним у поставкама учитавања. Постављање овога на “не” ће сакрити поље на страницама прегледа тема, профила и списка чланова.',
	'DROPDOWN_ENTRIES_EXPLAIN'		=> 'Унесите сада ваше понуде, свака понуда у новом реду.',

	'EDIT_DROPDOWN_LANG_EXPLAIN'	=> 'Молимо знајте да можете да промените текст ваших поставки као и да додајете нове поставке на крају. Није препоручљиво да додајете нове поставке између постојећих - ово може довести до погрешних поставки додељених вашим корисницима. Ово се такође дешава уколико уклоните поставке из-међу. Уклањањем поставки са краја доводи до тога да се корисници који имају додељену ову могућност сада враћају назад на подразумеване вредности.',
	'EMPTY_FIELD_IDENT'				=> 'Препознавање празног поља',
	'EMPTY_USER_FIELD_NAME'			=> 'Молимо вас да унесете име/назив поља',
	'ENTRIES'						=> 'Уноси',
	'EVERYTHING_OK'					=> 'Све је У Реду',

	'FIELD_BOOL'				=> 'Прекидач (Да/Не)',
	'FIELD_CONTACT_DESC'		=> 'Контакт опис',
	'FIELD_CONTACT_URL'			=> 'Контакт веза',
	'FIELD_DATE'				=> 'Датум',
	'FIELD_DESCRIPTION'			=> 'Опис поља',
	'FIELD_DESCRIPTION_EXPLAIN'	=> 'Објашњење за ово поље које се представља кориснику.',
	'FIELD_DROPDOWN'			=> 'Падајући списак',
	'FIELD_GOOGLEPLUS'			=> 'Google+',
	'FIELD_IDENT'				=> 'Препознавање поља',
	'FIELD_IDENT_ALREADY_EXIST'	=> 'Одабрано препознавање поља већ постоји. Молимо изаберите друго име.',
	'FIELD_IDENT_EXPLAIN'		=> 'Препознавање поља је име за препознавање поља профила у бази и предлошцима.',
	'FIELD_INT'					=> 'Бројеви',
	'FIELD_IS_CONTACT'			=> 'Прикажи поље као контакт поље',
	'FIELD_IS_CONTACT_EXPLAIN'	=> 'Контакт поља се приказују унутар одељка за контакт на корисниковом профилу и приказују се другачије на мини профилу поред порука и приватних порука. Можете користити <samp>%s</samp> као држач који ће бити замењен вредношћу пруженом од корисника.',
	'FIELD_LENGTH'				=> 'Дужина поља за унос',
	'FIELD_NOT_FOUND'			=> 'Поље профила није пронађено.',
	'FIELD_STRING'				=> 'Једноставно текстуално поље',
	'FIELD_TEXT'				=> 'Текстуално поље',
	'FIELD_TYPE'				=> 'Тип поља',
	'FIELD_TYPE_EXPLAIN'		=> 'Не можете касније да промените тип поља.',
	'FIELD_URL'					=> 'URL (Веза)',
	'FIELD_VALIDATION'			=> 'Потврда поља',
	'FIRST_OPTION'				=> 'Прва понуда',

	'HIDE_PROFILE_FIELD'			=> 'Сакриј поље профила',
	'HIDE_PROFILE_FIELD_EXPLAIN'	=> 'Сакриј поље профила од свих других корисника осим самог корисника лично, администратора и уредника који могу и даље да виде ово поље профила. Уколико је поставка Приказа у корисничкој контролној плочи онемогућена, корисник неће моћи да види нити да промени ово поље профила а поље може бити промењено само од администратора.',

	'INVALID_CHARS_FIELD_IDENT'	=> 'Препознавање поља може да садржи само мала слова a-z и _',
	'INVALID_FIELD_IDENT_LEN'	=> 'Препознавање поља може бити само 17 знакова дугачко',
	'ISO_LANGUAGE'				=> 'Језик [%s]',

	'LANG_SPECIFIC_OPTIONS'		=> 'Посебне поставке језика [<strong>%s</strong>]',

	'LETTER_NUM_DOTS'			=> 'Било која слова, бројеви и тачке (повремено)',
	'LETTER_NUM_ONLY'			=> 'Било која слова и бројеви',
	'LETTER_NUM_PUNCTUATION'	=> 'Било која слова, бројеви, зарези, тачке, цртице за подвлачење текста и цртице које почињу са словом',
	'LETTER_NUM_SPACERS'		=> 'Било која слова, бројеви и размаци',
	'LETTER_NUM_UNDERSCORE'		=> 'Било која слова, бројеви и цртице за подвлачење текста',

	'MAX_FIELD_CHARS'		=> 'Највећи број знакова',
	'MAX_FIELD_NUMBER'		=> 'Највиши дозвољени број',
	'MIN_FIELD_CHARS'		=> 'Најмањи број знакова',
	'MIN_FIELD_NUMBER'		=> 'Најнижи дозвољени број',

	'NO_FIELD_ENTRIES'			=> 'Нема одређених уноса',
	'NO_FIELD_ID'				=> 'id поља није одређен.',
	'NO_FIELD_TYPE'				=> 'Није изабран тип Поља.',
	'NO_VALUE_OPTION'			=> 'Поставка једнака неунетој вредности',
	'NO_VALUE_OPTION_EXPLAIN'	=> 'Вредност за не-унети унос. Уколико је поље обавезно, корисник добија грешку уколико изабере поставку изабрану овде.',
	'NUMBERS_ONLY'				=> 'Само бројеви (0-9)',

	'PROFILE_BASIC_OPTIONS'		=> 'Основне поставке',
	'PROFILE_FIELD_ACTIVATED'	=> 'Поље профила је успешно активирано.',
	'PROFILE_FIELD_DEACTIVATED'	=> 'Поље профила је успешно деактивирано.',
	'PROFILE_LANG_OPTIONS'		=> 'Посебне поставке језика',
	'PROFILE_TYPE_OPTIONS'		=> 'Посебне поставке типа профила',

	'RADIO_BUTTONS'				=> 'Дугмад',
	'REMOVED_PROFILE_FIELD'		=> 'Поље профила је успешно уклоњено.',
	'REQUIRED_FIELD'			=> 'Обавезно поље',
	'REQUIRED_FIELD_EXPLAIN'	=> 'Форсирање поља профила да буде попуњено или назначено од стране корисника или администратора. Уколико је поставка прикажи на екрану за регистрацију онемогућена, поље ће бити тражено само онда када корисник мења свој профил.',
	'ROWS'						=> 'Редови',

	'SAVE'							=> 'Сачувај',
	'SECOND_OPTION'					=> 'Друга понуда',
	'SHOW_NOVALUE_FIELD'			=> 'Прикажи поље уколико ниједна вредност није изабрана',
	'SHOW_NOVALUE_FIELD_EXPLAIN'	=> 'Одређује да ли поље профила треба да буде приказано уколико ниједна вредност није изабрана за необавезна поља или уколико још увек ниједна вредност није изабрана за обавезна поља.',
	'STEP_1_EXPLAIN_CREATE'			=> 'Овде можете унети прве основне параметре вашег новог поља профила. Овај податак је потребан за други корак где ћете моћи да подесите преостале поставке и даље дотерати ваше поље профила.',
	'STEP_1_EXPLAIN_EDIT'			=> 'Овде можете променити основне параметре вашег поља профила. Одговарајуће поставке су пре-рачунате у другом кораку.',
	'STEP_1_TITLE_CREATE'			=> 'Додај поље профила',
	'STEP_1_TITLE_EDIT'				=> 'Учитај поље профила',
	'STEP_2_EXPLAIN_CREATE'			=> 'Овде можете да одредите неке уобичајене поставке које можда желите да подесите.',
	'STEP_2_EXPLAIN_EDIT'			=> 'Овде можете да промените неке уобичајене поставке.<br /><strong>Молимо знајте да промене у пољима профила неће утицати на постојећа поља профила унета од ваших корисника.</strong>',
	'STEP_2_TITLE_CREATE'			=> 'Посебне поставке типа профила',
	'STEP_2_TITLE_EDIT'				=> 'Посебне поставке типа профила',
	'STEP_3_EXPLAIN_CREATE'			=> 'Пошто имате више од једног језика инсталирано на форуму, мораћете такође да попуните преостале ставке језика. Поље профила ће радити са омогућеним подразумеваним језиком, такође можете да попуните преостале језичке ставке касније.',
	'STEP_3_EXPLAIN_EDIT'			=> 'Пошто имате више од једног језика инсталирано на форуму, сада такође можете да промените или додате преостале језичке ставке. Поље профила ће радити са омогућеним подразумеваним језиком.',
	'STEP_3_TITLE_CREATE'			=> 'Преостале језичке одреднице',
	'STEP_3_TITLE_EDIT'				=> 'Језичке одреднице',
	'STRING_DEFAULT_VALUE_EXPLAIN'	=> 'Унесите подразумевани израз који ће бити приказан, подразумевану вредност. Оставите празно уколико желите да га прикажете као празно на првом месту.',

	'TEXT_DEFAULT_VALUE_EXPLAIN'	=> 'Унесите подразумевани текст који ће бити приказан, подразумевану вредност. Оставите празно уколико желите да га прикажете као празно на првом месту.',
	'TRANSLATE'						=> 'Преведи',

	'USER_FIELD_NAME'	=> 'Назив поља/поља представљен кориснику',

	'VISIBILITY_OPTION'				=> 'Поставке видљивости',
));
